ka2_2024/src/AccumulationRegisters/ТрудозатратыНезавершенногоПроизводства/ТрудозатратыНезавершенногоПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТрудозатратыНезавершенногоПроизводства</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормативнаяСтоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостояннаяРазница</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ВременнаяРазница</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьНДД</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПродукции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаПродукции</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КорРазделУчета</name>
    <type>
      <types>EnumRef.РазделыУчетаСебестоимостиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КорВидЗапасовПродукции</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляцииБезЗаказа</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВыпуска</name>
    <type>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.ПоступлениеОтПереработчика</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтроки</name>
    <comment>Код строки документа выпуска</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетПартий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаПартий</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПартий</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетНеЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРаботСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидФондаВзносов</name>
    <type>
      <types>EnumRef.ВидыФондовВзносов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПартияПроизводства</name>
    <type>
      <types>CatalogRef.ПартииПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтрокиПродукция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ЭтапыПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаПродукции</name>
    <type>
      <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ka2_2024/src/AccumulationRegisters/ТрудозатратыНезавершенногоПроизводства/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Собирает структуру из текстов запросов для дальнейшей проверки даты запрета.
// 
// Параметры:
// 	Запрос - Запрос - Запрос по проверке даты запрета, можно установить параметры
// Возвращаемое значение:
// 	Структура - см. ЗакрытиеМесяцаСервер.ИнициализироватьСтруктуруТекстовЗапросов
Функция ТекстЗапросаКонтрольДатыЗапрета(Запрос) Экспорт
	ИмяРегистра = Метаданные.РегистрыНакопления.ТрудозатратыНезавершенногоПроизводства.Имя;
	ИмяТаблицыИзменений = "ТаблицаИзмененийТрудозатратыНезавершенногоПроизводства"; 
	СтруктураТекстовЗапросов = ПроведениеДокументов.ШаблонТекстЗапросаКонтрольДатыЗапрета(Запрос, 
		ИмяРегистра, 
		ИмяТаблицыИзменений, 
		"ФинансовыйКонтур");
	Возврат СтруктураТекстовЗапросов

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Заполняет параметры отражения движений регистра в финансовом учете
//
// Параметры:
//  МетаданныеРегистра - ОбъектМетаданныхРегистрНакопления - Метаданные регистра накопления
//  РегистрацияКОтражению - Булево - Признак получения параметров для регистрации к отражению в учете
//
// Возвращаемое значение:
// 	см. ФинансовыйУчетПоДаннымБалансовыхРегистров.ПараметрыОтраженияДвиженийВФинансовомУчете
//
Функция ПараметрыОтраженияДвиженийВФинансовомУчете(МетаданныеРегистра = Неопределено, РегистрацияКОтражению = Ложь) Экспорт
	
	ПараметрыОтражения = ФинансовыйУчетПоДаннымБалансовыхРегистров.ПараметрыОтраженияДвиженийВФинансовомУчете(РегистрацияКОтражению);
	
	Если РегистрацияКОтражению Тогда
		Возврат ПараметрыОтражения;
	КонецЕсли;
	
	ПараметрыОтражения.ПутьКДаннымНаправлениеДеятельности = "ПартияПроизводства.НаправлениеДеятельности";
	ПараметрыОтражения.ПутьКДаннымПодразделение = "Подразделение";
	ПараметрыОтражения.РесурсыУпр.Добавить("Стоимость");
	ПараметрыОтражения.РесурсыРегл.Добавить("СтоимостьРегл");
	ПараметрыОтражения.РесурсыКоличество.Добавить("Количество");
	ПараметрыОтражения.ТипДанныхУчета = Перечисления.ТипыДанныхУчета.ДоходыРасходы;
	ПараметрыОтражения.СтруктураАналитики = ОбщегоНазначения.СкопироватьРекурсивно(ИсточникиДанныхПовтИсп.СтруктураАналитикиПоТипуДанныхУчета(ПараметрыОтражения.ТипДанныхУчета));
	ПараметрыОтражения.СтруктураАналитики.СтатьяДоходовРасходов.Вставить("Значение", Неопределено);
	ПараметрыОтражения.СтруктураАналитики.АналитикаДоходов.Вставить("Значение", Неопределено);
	ПараметрыОтражения.СтруктураАналитики.АналитикаРасходов.Вставить("Значение", Неопределено);
	
	Если МетаданныеРегистра = Неопределено Тогда
		МетаданныеРегистра = СоздатьНаборЗаписей().Метаданные();
	КонецЕсли;
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ЗаполнитьПараметрыОтраженияПоМетаданнымРегистра(ПараметрыОтражения, МетаданныеРегистра);
	
	Возврат ПараметрыОтражения;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы


#КонецОбласти

#КонецОбласти

#КонецЕсли
